app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
#affiche la page articles/index.html.erb et initialise la variable @livres

    @potins = Article.all